Revit 2027 API
RebarHandleNameData.SetCustomHandleName Method
 Sets the name of the handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCustomHandleName(
	string customHandleName
)
Public Sub SetCustomHandleName (
	customHandleName As String
)
public:
void SetCustomHandleName(
	String^ customHandleName
)
member SetCustomHandleName :
        customHandleName : string -> unit
Parameters
customHandleName String
 The name of the handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace